INSERT INTO categories(id, category_name)
VALUES 
(1, 'Супы'),
(2, 'Основные блюда'),
(3, 'Закуски'),
(4, 'Десерты');


INSERT INTO dishes(id, name, category_id, price)
VALUES 
(1, 'Борщ', 1, 160),
(2, 'Рассольник', 1, 140),
(3, 'Бефстроганов', 2, 180),
(4, 'Пельмени', 2, 170),
(5, 'Салат овощной', 3, 120),
(6, 'Салат Цезарь', 3, 150),
(7, 'Чизкейк', 4, 110),
(8, 'Торт Прага', 4, 130);


INSERT INTO orders(order_id, dish_id, order_date, quantity, total_price)
VALUES 
(1, 1, '2025-11-01', 3, 480),
(2, 2, '2025-11-02', 2, 280),
(3, 3, '2025-11-03', 4, 720),
(4, 4, '2025-11-04', 3, 510),
(5, 5, '2025-11-05', 3, 360),
(6, 6, '2025-11-06', 5, 750),
(7, 7, '2025-11-07', 3, 330),
(8, 8, '2025-11-08', 2, 260);